[
  {
    "id": 1,
    "date": "2022-01-22T00:00:00",
    "category": "linux",
    "tags": ["linux", "sistema operacional", "kernel"],
    "title": "Por que usar o Linux como Sistema Operacional?",
    "description": "<p>Provavelmente você já deve ter utilizado algum sistema Linux ou baseado nele. Sim, se você já usou um sistema Android, um MacOs, IOS ou se simplesmente já configurou o roteador da sua casa, você possui uma vivência com o sistema. Linux não é somente um sistema operacional, mas sim uma nomenclatura dada a sistemas baseados no Kernel Linux, que é um software disponível para modificações onde várias empresas criam suas próprias distribuições.</p><br/><br/><img src='https://i.imgur.com/qbW8Ops.png' width='100%'/><br/><br/><p>Agora, por que utilizar o Linux como Sistema Operacional?</p><br/><h3>1 – O Linux é gratuito</h3><br/><p>O fato mais chamativo dos sistemas operacionais Linux é o fato da maioria das plataformas serem gratuitas, onde você pode escolher a distribuição que mais agrada sua necessidade e não precisa se preocupar com pirataria ou a expiração de licença. Existe a mais ampla gama de distribuições, sendo elas desde utilização para desktop, servidores e até sistemas voltados para segurança de rede, ou seja, existem inúmeras utilizações e aplicações para cada caso.</p><br/><p>Em relação aos softwares, as distros possuem uma infinidade de softwares também gratuitos em seu repositório de pacotes nativo e conta com uma grande quantidade de softwares disponíveis para serem baixados e instalados pela internet, incluindo softwares de desenvolvimento, jogos, escritório, editores de vídeo e muito mais.</p><br/><h3>2 – Portabilidade – Sistema operacional Linux</h3><br/><p>Grande parte dos sistemas operacionais tentam utilizar o mínimo de recursos possível da máquina. Nas distros Linux existem sistemas com interface gráfica amigável que utilizam apenas 512MB de memória RAM, além do fato que podem rodar até mesmo em um pendrive com pouco espaço de armazenamento.</p><br/><p>Existem plataformas já desenvolvidas para rodar sistemas Linux nativamente consumindo o mínimo de recursos possível como o Raspberry Pi, um computador “portátil” que pode ser utilizado com um cartão de memória comum como armazenamento.</p><br/><p>O Linux é muito utilizado em servidores também graças ao fato de consumir pouco recurso de hardware da máquina, tendo como prioridade o desempenho dos serviços.</p>"
  },
  {
    "id": 2,
    "date": "2022-01-22T00:00:00",
    "category": "dev",
    "tags": ["vscode", "ambiente de desenvolvimento", "dev"],
    "title": "Title 2",
    "description": "Description 2"
  },
  {
    "id": 3,
    "date": "2022-01-22T00:00:00",
    "category": "git",
    "tags": ["git", "github"],
    "title": "Title 3",
    "description": "Description 3"
  }
]
