[
  {
    "id": 1,
    "date": "2022-01-22T00:00:00",
    "category": "linux",
    "tags": ["linux", "sistema operacional", "kernel"],
    "title": "Por que usar o Linux como Sistema Operacional?",
    "description": "<p>Provavelmente você já deve ter utilizado algum sistema Linux ou baseado nele. Sim, se você já usou um sistema Android, um MacOs, IOS ou se simplesmente já configurou o roteador da sua casa, você possui uma vivência com o sistema. Linux não é somente um sistema operacional, mas sim uma nomenclatura dada a sistemas baseados no Kernel Linux, que é um software disponível para modificações onde várias empresas criam suas próprias distribuições.</p><br/><br/><img src='https://i.imgur.com/qbW8Ops.png' width='100%'/><br/><br/><p>Agora, por que utilizar o Linux como Sistema Operacional?</p><br/><h3>O Linux é gratuito</h3><br/><p>O fato mais chamativo dos sistemas operacionais Linux é o fato da maioria das plataformas serem gratuitas, onde você pode escolher a distribuição que mais agrada sua necessidade e não precisa se preocupar com pirataria ou a expiração de licença. Existe a mais ampla gama de distribuições, sendo elas desde utilização para desktop, servidores e até sistemas voltados para segurança de rede, ou seja, existem inúmeras utilizações e aplicações para cada caso.</p><br/><p>Em relação aos softwares, as distros possuem uma infinidade de softwares também gratuitos em seu repositório de pacotes nativo e conta com uma grande quantidade de softwares disponíveis para serem baixados e instalados pela internet, incluindo softwares de desenvolvimento, jogos, escritório, editores de vídeo e muito mais.</p><br/><h3>Portabilidade – Sistema operacional Linux</h3><br/><p>Grande parte dos sistemas operacionais tentam utilizar o mínimo de recursos possível da máquina. Nas distros Linux existem sistemas com interface gráfica amigável que utilizam apenas 512MB de memória RAM, além do fato que podem rodar até mesmo em um pendrive com pouco espaço de armazenamento.</p><br/><p>Existem plataformas já desenvolvidas para rodar sistemas Linux nativamente consumindo o mínimo de recursos possível como o Raspberry Pi, um computador “portátil” que pode ser utilizado com um cartão de memória comum como armazenamento.</p><br/><p>O Linux é muito utilizado em servidores também graças ao fato de consumir pouco recurso de hardware da máquina, tendo como prioridade o desempenho dos serviços.</p><br/><h3>Personalizável – Linux como sistema operacional</h3><br/><p>Com uma variedade de ambientes gráficos, você consegue deixar o sistema do seu próprio jeito, podendo mudar para uma melhor performance de suas atividades, até a customização da parte gráfica, onde podemos alterar desde a barra de menu até a Splash screen.</p><br/><p>Mesmo sem utilizar ambientes gráficos é possível inserir customizações dentro de servidores utilizando alguns recursos nativos, por exemplo a alteração da exibição da linha de comando, deixando mais claro a utilização, adicionar banners de indicação para serviços de acesso remoto, sem limites à utilização.</p><br/><h3>Segurança</h3><br/><p>Os servidores baseados em Linux possuem a capacidade de serem flexíveis o bastante para atender uma gama de necessidades  executando desde serviços de firewall e servidores web. As distribuições deixam claro ao usuário o que está sendo utilizado no sistema, é muito difícil que o usuário comum consiga executar algo que destrua o sistema sem a visualização prévia do conteúdo. Um outro fator levado em consideração pelas empresas ao utilizarem Linux é a baixa existência de vírus funcionais quando comparado com o sistema Microsoft Windows, já que devido ao seu sistema de permissionamento, o usuário comum fica mais restrito à executar ações/scripts que possam ser prejudicial ao sistema operacional, tornando-se assim mais seguros.</p><br/><p>Não existindo assim a necessidade evidente da utilização de um software de antivírus, somente que mantenha um serviço de firewall ativo na máquina para que gerencie tentativas de acesso remoto.</p><br/><h3>Ótimo sistema para desenvolvimento</h3><br/><p>Linux já vem por padrão com interpretadores e compiladores de várias linguagens, por exemplo o gcc, python, shell, java além de algumas distribuições já possuírem também por padrão um ambiente de desenvolvimento nativo. Se você procura aprender programação, usar linux é uma ótima opção.</p><br/><h3>Linux também roda jogos</h3><br/><p>Há muito tempo que não existe mais a famosa frase “Linux não roda jogos”. A Steam e várias outras plataformas já desenvolveram sistemas próprios para rodar seus jogos em sistemas Linux. Mesmo a plataforma não possuindo todos os jogos que rodam no Windows, é possível contar com uma grande variedade que acabam rodando no Linux consumindo ainda menos recursos da máquina devido a utilização do sistema. Grandes franquias como, Counter Strike GO, Dota, Team Fortress 2, Terraria, Borderlands conseguem ser executadas com sucesso na plataforma.</p><br/><h3>Perfeito para ambientes escritórios</h3><br/><p>Além de possuir uma enorme gama de aplicativos gratuitos para uso em escritórios, as distribuições mais comuns como Linux Mint, Ubuntu, Fedora, Debian entre outras, oferecem um ambiente agradável e de fácil utilização. Ferramentas como Gimp, Blender, LibreOffice, Inkscape, até softwares de animação como o Open Toonz são de uso livre e podem ser utilizadas sem maiores problemas.</p><br/><h3>Automação</h3><br/><p>O Linux também conta com ambientes perfeitos para automatização de tarefas. Ferramentas poderosas como Ansible, Puppet, Chef e Terraform possuem a capacidade de realizarem tarefas que antes eram manualmente realizadas para um novo ambiente totalmente configurado a partir de um script de configuração.</p><br/><p>Se você acha que está pronto para usar o Linux, deixo aqui a distribuição que utilizo:</p><br/><p>Linux Mint: <a href='https://linuxmint.com/' target='_blank'>https://linuxmint.com/</a></p><br/><p>Você também pode conferir outras diversas distros que pode lhe agradar: <a href='https://distrowatch.com/' target='_blank'>https://distrowatch.com/</a></p>"
  },
  {
    "id": 2,
    "date": "2022-01-22T00:00:00",
    "category": "dev",
    "tags": ["vscode", "ambiente de desenvolvimento", "dev"],
    "title": "Title 2",
    "description": "Description 2"
  },
  {
    "id": 3,
    "date": "2022-01-22T00:00:00",
    "category": "git",
    "tags": ["git", "github"],
    "title": "Title 3",
    "description": "Description 3"
  }
]
